Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་དྲི་མ་མ་མཆིས་པ་ལགས་སོ། །
en: “Blessed One, this absorption is so immaculate!”

source: འདོད་ཆགས་ཀྱི་རྡུལ་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: “Yes, because it is free of the dust of attachment.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་རྒྱུ་བ་མ་མཆིས་པ་ལགས་སོ། །
en: “Blessed One, this absorption is unmoving!”

source: ཁམས་གསུམ་དུ་མི་རྒྱུ་བའི་ཕྱིར་རོ། །
en: “Yes, because it does not move within the three realms.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་སྤྲོས་པ་མ་མཆིས་པ་ལགས་སོ། །
en: “Blessed One, this absorption is conceptually unstructured!”

source: སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་རོ། །
en: “Yes, because it is free from all conceptual structuring.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་མི་གཡོ་བ་ལགས་སོ། །
en: “Blessed One, this absorption does not fluctuate!”

source: ཤིན་ཏུ་མཐར་ཐུག་པའི་ཕྱིར་རོ། །
en: “Yes, because it is final.”

source: བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་འདི་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་ཞུགས་པ་ལགས་སོ། །
en: “Blessed One, this absorption reaches everywhere!”

source: ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་པའི་ཕྱིར་རོ། །
en: “Yes, because it is alike and akin to space.”

source: བཅོམ་ལྡན་འདས་བརྩོན་འགྲུས་བརྩམས་པ་ཅི་འདྲ་བ་ཞིག་གིས་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་ནུས།
en: “Blessed One, what types of diligent actions will lead one to the attainment of this pristine and immaculate absorption seal?”

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ། དཔེར་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་ནམ་མཁའ་དང་གཡུལ་འགྱེད་པ་འདོད་པར་གྱུར་ན་དེས་ནམ་མཁའི་གོ་ཆ་ཉིད་བགོ་བར་བྱའོ། །
en: “To draw an analogy, Sāgaramati, if someone wanted to wage war on the sky, they should don the armor of the sky.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འདོད་པས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་གོ་ཆ་ཉིད་བགོ་བར་བྱའོ། །
en: Sāgaramati, when one desires to attain the pristine and immaculate absorption seal, one should don the armor of the sameness of all phenomena.

source: བློ་གྲོས་རྒྱ་མཚོ་འགོད་པ་ཅི་འདྲ་བར་འཐོབ་པའང་དེ་འདྲ་བའི་ཕྱིར་རོ། །
en: Sāgaramati, attainment is determined by one’s preparations.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་རྣམ་པར་ཤེས་པ་ནི་འདུས་བྱས་ཀྱི་ས་བོན་ནོ། །
en: “Sāgaramati, consciousness is the seed of the conditioned.

source: རྣམ་པར་རིག་པ་མེད་པ་ནི་འདུས་མ་བྱས་ཀྱི་ས་བོན་ཏེ། ཏིང་ངེ་འཛིན་འདི་ནི་རྣམ་པར་རིག་པ་མེད་པའི་ས་བོན་ནོ། །
en: Non-cognition is the seed of the unconditioned, and this absorption is the seed of non-cognition.

source: ཏིང་ངེ་འཛིན་འདི་ནི་མིག་གི་རྣམ་པར་ཤེས་པས་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: This absorption cannot be perceived by the eye consciousness, nor by the consciousness of the ear, nose, tongue, body, or mind.

source: ཏིང་ངེ་འཛིན་འདི་ནི་རྣམ་པར་རིག་པས་རྟོགས་པར་བྱ་བ་མ་ཡིན་ནོ། །ཚོར་བས་མ་ཡིན་ཏེ།
en: This absorption cannot be realized by cognizing or feeling it;

source: ཏིང་ངེ་འཛིན་འདི་ནི་ཚོར་བ་དང་། རྣམ་པར་རིག་པ་མེད་པའི་མཚན་ཉིད་དོ། །
en: this absorption has the characteristic of being without feeling and cognition.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པས་དེའི་ཕྱིར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །
en: Because it realizes all phenomena to be sameness, it is called perfect buddhahood.

source: བློ་གྲོས་རྒྱ་མཚོ་ངས་ནི་མཚན་ཉིད་གཞན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མ་ཡིན།
en: “Sāgaramati, I did not understand pollution through some other characteristic.

source: མཚན་ཉིད་གཞན་གྱིས་རྣམ་པར་བྱང་བ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མ་ཡིན་ནོ། །
en: Nor did I understand purification through some other characteristic.

source: ཀུན་ནས་ཉོན་མོངས་པའི་མཚན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་རྣམ་པར་བྱང་བའི་མཚན་ཉིད་དེ་འདི་ལྟ་སྟེ།
en: The basic characteristic of pollution is the same as purification.

source: རང་བཞིན་གྱིས་རྣམ་པར་དག་པའི་མཚན་ཉིད་དོ། །
en: Their basic characteristic is that they are naturally pure.

source: རང་བཞིན་གྱིས་རྣམ་པར་དག་པའི་མཚན་ཉིད་གང་ཡིན་པ་དེ་མཚན་ཉིད་མེད་པའོ། །
en: The basic characteristic of being naturally pure is to be without characteristics.

source: མཚན་ཉིད་མེད་པ་གང་ཡིན་པ་དེ་མཚན་མ་མེད་པའོ། །
en: Being without characteristics is signlessness.

source: མཚན་མ་མེད་པ་གང་ཡིན་པ་དེ་ལ་སོ་སོར་རྣམ་པར་རིག་པ་གང་ཡང་མེད་དོ། །
en: There is nothing in signlessness that can be discerned.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་རིག་པ་མེད་ཅིང་རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན་པའོ། །
en: “Sāgaramati, no phenomenon can be cognized nor is to be cognized.

source: ཆོས་གང་རྣམ་པར་རིག་པ་མེད་ཅིང་རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན་པ་དེ་ལ་ཡི་གེ་རྣམས་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: Language does not occur where no phenomenon can be cognized nor is to be cognized.

source: གང་ལ་ཡི་གེ་རྣམས་ཀུན་ཏུ་མི་འབྱུང་བ་དེ་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: Where no language occurs, things are just as they are.

source: ཇི་ལྟ་བ་བཞིན་གང་ཞེ་ན།
en: How are things just as they are?

source: སྔོན་གྱི་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན་བར་དུ་ཡང་དེ་བཞིན་ཏེ།
en: As it was before, so will it be after.

source: དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་དུས་གསུམ་དུ་སྟོང་པ་ཞེས་བྱའོ། །
en: Thus, all phenomena are said to be empty throughout the three times.

source: ཅིའི་ཕྱིར་སྟོང་པ་ཉིད་ཅེས་བྱ་ཞེ་ན།
en: Why are they described as emptiness?

source: དེ་ནི་མ་བྱས་པ་བྱ་བར་འགྱུར་བ་མ་ཡིན་པ། བྱ་བ་མ་ཡིན་པ་རྣམ་པར་བྱ་བ་མ་ཡིན་པ་སྟེ།
en: They have not been made, will not be made, are not being made, and are not in a process of making.

source: དེའི་ཕྱིར་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: Thus, they are called emptiness.

source: བྱ་བ་མ་ཡིན་པ་གང་ཞེ་ན།
en: “What does not being made refer to?

source: འདི་ལྟ་སྟེ། མངོན་པར་འདུ་བྱ་བ་མེད་པ་སྟེ།
en: It refers to being unconditioned.

source: དེ་ལྟར་མི་བྱེད་པས་བྱས་པའི་ཆོས་གང་ཡང་མེད་དོ། །
en: Because they are not being made, there are no phenomena that have been made.

source: དེའི་ཕྱིར་དེ་ནི་བྱ་བར་འགྱུར་བ་མེད་པ་ཞེས་བྱའོ། །
en: That is why it is said there is nothing that will be made.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་གང་ཞེ་ན།
en: What does being unconditioned refer to?

source: གང་ལ་ལུས་ཀྱིས་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། ངག་གིས་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། ཡིད་ཀྱིས་མངོན་པར་འདུ་བྱ་བ་མེད་པ་སྟེ།
en: It refers to being without any physical, verbal, or mental formations.

source: འདི་ནི་མངོན་པར་འདུ་བྱ་བ་མེད་པ་ཞེས་བྱའོ། །
en: That is what is meant by being unconditioned.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་གང་ཡིན་པ་དེ་འདུས་མ་བྱས་ཏེ། དེ་ལ་ནི་སྐྱེ་བ་མེད། འཇིག་པ་མེད། གནས་པ་མེད་དོ། །
en: What is not made is unconditioned: it is unborn, indestructible, baseless.

source: གང་ལ་སྐྱེ་བ་མེད། འཇིག་པ་མེད། གནས་པ་མེད་པ་དེ་དག་གནས་མེད་པའོ། །
en: What is unborn, indestructible, and baseless has no basis.

source: གང་ལ་གནས་དེ་མེད་ཅེ་ན།
en: In what way is it baseless?

source: མངོན་པར་འདུ་བྱ་བ་ཐམས་ཅད་ལ་གནས་དེ་མེད་དེ།
en: It is not based on anything that has been formed.

source: དེའི་ཕྱིར་གནས་དེ་མེད་པ་ཞེས་བྱའོ། །
en: Thus, it is said to be without a base.

source: དེ་ལ་ནི་གཟུགས་ལ་སོང་བའི་རྣམ་པར་ཤེས་པ་མི་གནས།
en: In this regard, a consciousness that gravitates toward form is baseless.

source: ཚོར་བ་ལ་སོང་བ་དང་། འདུ་ཤེས་ལ་སོང་བ་དང་། འདུ་བྱེད་ལ་སོང་བ་དང་། རྣམ་པར་ཤེས་པ་ལ་སོང་བའི་རྣམ་པར་ཤེས་པ་མི་གནས་སོ། །
en: A consciousness that moves toward feeling, perception , formation, or consciousness is likewise baseless.

source: རྣམ་པར་ཤེས་པ་མི་གནས་པ་གང་ཡིན་པ་དེ་ཡེ་ཤེས་དང་ལྡན་པའོ། །
en: A baseless consciousness is replete with wisdom.

source: ཡེ་ཤེས་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ཡེ་ཤེས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱེད་པའོ། །
en: One who is replete with wisdom is prevented by wisdom from becoming conceited.

source: གང་རློམ་སེམས་སུ་མི་བྱེད་པ་དེ་མངོན་པར་རློམ་སེམས་སུ་མི་བྱེད་དོ། །
en: One who is prevented from becoming conceited cannot become arrogant.

source: གང་མངོན་པར་རློམ་སེམས་སུ་མི་བྱེད་པ་དེ་མི་རྩོད་དོ། །
en: One who cannot become arrogant does not debate.

source: གང་མི་རྩོད་པ་དེ་ཀུན་ཏུ་མི་འབར་རོ། །
en: One who does not debate does not become inflamed.

source: གང་ཀུན་ཏུ་མི་འབར་བ་དེ་ཀུན་ཏུ་གདུང་བ་མ་ཡིན་ནོ། །
en: One who does not become inflamed is not pained.

source: གང་ཀུན་ཏུ་གདུང་བ་མ་ཡིན་པ་དེ་རབ་ཏུ་འབར་བ་མ་ཡིན་ནོ། །
en: One who is not pained does not smolder.

source: གང་རབ་ཏུ་འབར་བ་མ་ཡིན་པ་དེ་ཞི་བའོ། །
en: One who does not smolder is at peace.

source: ཞི་བ་གང་ཡིན་པ་དེ་རབ་ཏུ་ཞི་བའོ། །
en: One who is at peace is utterly peaceful.

source: རབ་ཏུ་ཞི་བ་གང་ཡིན་པ་དེ་ཉེ་བར་ཞི་བའོ། །
en: One who is utterly peaceful is deeply at peace.

source: ཉེ་བར་ཞི་བ་གང་ཡིན་པ་དེ་ཐུབ་པ་ཞེས་བྱའོ། །སྟོན་པ་ཞེས་བྱའོ། །
en: One who is deeply at peace is called a sage—who is called a teacher.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་འདི་དག་ནི་འདི་ལྟར་ཟབ་པའོ། །འདི་ལྟར་བལྟ་དཀའ་བའོ། །འདི་ལྟར་རྟོགས་པར་དཀའ་བའོ། །
en: “Sāgaramati, these points are so profound, so difficult to see, and so difficult to realize.

source: གང་དག་གིས་ཆོས་འདི་དག་ཐོས་ནས་མོས་པར་བྱེད་པ་དེ་དག་ཐམས་ཅད་ཕྱིན་ཅི་ལོག་པ་དང་ཉེ་བའི་ཉོན་མོངས་པ་དང་། ཡོངས་སུ་འཛིན་པ་དང་། འཆིང་བ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་ཏེ།
en: Anyone who hears these teachings and is inspired by them will be liberated from error, and the perpetuation of affliction, grasping, and bondage.

source: འདི་དག་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཀྱི་མཛོད་འཛིན་པ་དག་གོ། །
en: They will uphold the Dharma treasury of the blessed buddhas of the past, present, and future.

source: དེ་དང་དེ་དག་ནི་དེད་དཔོན་ཆེན་པོ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་ལམ་ཚད་མེད་པ་སྟོན་པ་དག་གོ། །
en: They will be great captains who teach limitless paths to beings.

source: དེ་དང་དེ་དག་ནི་སྨན་པའི་རྒྱལ་པོ་སྟེ། ཉོན་མོངས་པ་གཟུགས་ཅན་མ་ཡིན་པའི་ནད་ལས་རབ་ཏུ་ཐར་བར་བྱེད་པ་དག་གོ། །
en: They will be the foremost physicians who heal the formless disease of afflictive emotions.

source: དེ་དང་དེ་དག་ནི་མཆོད་པ་མཆོག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བྱེད་པ་དག་སྟེ།
en: They will venerate the thus-gone ones with the finest offerings.

source: དེ་དག་ནི་རིང་པོ་མི་ཐོགས་པ་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འགྱུར་རོ། །
en: Before long, they will attain the pristine and immaculate absorption seal.

source: དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་འདིར་ངེས་པར་བྱས་པ་དག་གོ། །
en: They will find certainty in the Great Vehicle.

source: དེ་དག་ནི་ཆོས་ཀྱི་གྲུ་ཆེན་པོ་ཡང་དག་པར་སྦྱར་བ་དག་གོ། །
en: They will make good use of the great raft of Dharma.

source: དེ་དག་ནི་སེམས་ཅན་ཚད་མེད་པ་དག་འཁོར་བའི་ཆུ་བོ་ཆེན་པོ་ལས་སྒྲོལ་བར་འགྱུར་བ་དག་གོ། །
en: They will free limitless beings from the great river of saṃsāra.

source: དེ་དག་ནི་ཡང་བདུད་ཀྱི་ཡུལ་དུ་བརྗོད་པ་མ་ཡིན་པ་དག་གོ། །
en: They will not be said to be under the influence of māras.

source: སྐྱེས་བུ་དམ་པ་དེ་དག་ནི་བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་དག་གོ། །
en: These sublime beings will defeat all māras and opposing forces.”

source: ཏིང་ངེ་འཛིན་བསྟན་པའི་ལེའུ་སྟེ། གསུམ་པའོ།། །།
en: [Chapter Four: The Teaching on the Absorption]

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Sāgaramati then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ལགས།
en: “Blessed One, how do bodhisattvas defeat māras and obstructers?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་གང་གི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་དོན་དུ་མི་གཉེར་བ་དེའི་ཚེ་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཡིན་ནོ། །
en: “Sāgaramati,” answered the Blessed One, “when bodhisattva great beings are no longer interested in any clinging, they defeat māras and obstructers.

source: གང་གི་ཚེ་མཚན་མ་དང་དམིགས་པ་ཐམས་ཅད་དོན་དུ་མི་གཉེར་བ་དེའི་ཚེ་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཡིན་ནོ། །
en: When they are no longer interested in marks and reference points, they defeat māras and obstructers.

source: བློ་གྲོས་རྒྱ་མཚོ་བདུད་ནི་བཞི་པོ་འདི་དག་སྟེ།
en: Sāgaramati, there are four māras:

source: བཞི་གང་ཞེ་ན། ཕུང་པོའི་བདུད་དང་། ཉོན་མོངས་པའི་བདུད་དང་། འཆི་བདག་གི་བདུད་དང་། ལྷའི་བུའི་བདུད་དེ་བཞི་པོ་འདི་དག་ནི་བདུད་དོ། །
en: the māra of the aggregates, the māra of the afflictions, the māra of the Lord of Death, and the māra of the gods.

source: དེ་ལ་སྒྱུ་མའི་ཆོས་སུ་སོ་སོར་རྟོག་པས་ཕུང་པོའི་བདུད་འཇོམས་སོ། །
en: “Regarding this, the māra of the aggregates is defeated by contemplating how phenomena are illusory.

source: སྟོང་པ་ཉིད་ངེས་པར་སེམས་པ་ལ་སོ་སོར་རྟོག་པས་ཉོན་མོངས་པའི་བདུད་འཇོམས་སོ། །
en: The māra of the afflictions is defeated by reflection on emptiness.

source: སྐྱེ་བ་མེད་པ་དང་འབྱུང་བ་མེད་པར་སོ་སོར་རྟོག་པས་འཆི་བདག་གིས་བདུད་འཇོམས་སོ། །
en: The māra of the Lord of Death is defeated by contemplating the unborn and non-arising.

source: ང་རྒྱལ་གྱིས་སྒྲོ་བཏགས་པ་ཐམས་ཅད་འགོག་པར་འགྱུར་བའི་ལམ་གྱིས་ལྷའི་བུའི་བདུད་འཇོམས་སོ། །
en: The māra of the gods is defeated by the path that halts all imputations made out of pride.

source: གཞན་ཡང་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པས་ཕུང་པོའི་བདུད་འཇོམས་སོ། །
en: “Moreover, the māra of the aggregates is defeated by understanding suffering.

source: ཀུན་འབྱུང་བ་སྤོང་བས་ཉོན་མོངས་པའི་བདུད་འཇོམས་སོ། །
en: The māra of the afflictions is defeated by abandoning the origin.

source: འགོག་པ་མངོན་སུམ་དུ་བྱེད་པས་འཆི་བདག་གི་བདུད་འཇོམས་སོ། །
en: The māra of the Lord of Death is defeated by actualizing cessation.

source: ལམ་སྒོམ་པས་ལྷའི་བུའི་བདུད་འཇོམས་སོ། །
en: The māra of the gods is defeated by cultivating the path.

source: གཞན་ཡང་འདུ་བྱེད་ཐམས་ཅད་ལ་སྡུག་བསྔལ་དུ་སོ་སོར་རྟོག་པས་ཕུང་པོའི་བདུད་འཇོམས་སོ། །
en: “Moreover, the māra of the aggregates is defeated by realizing formations to be suffering.

source: འདུ་བྱེད་ཐམས་ཅད་ལ་མི་རྟག་པར་སོ་སོར་རྟོག་པས་ཉོན་མོངས་པའི་བདུད་འཇོམས་སོ། །
en: The māra of the afflictions is defeated by realizing formations to be impermanent.

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་སོ་སོར་རྟོག་པས་འཆི་བདག་གི་བདུད་འཇོམས་སོ། །
en: The māra of the Lord of Death is defeated by realizing phenomena to be selfless.

source: མྱ་ངན་ལས་འདས་པ་ལ་ཞི་བར་སོ་སོར་རྟོག་པས་ལྷའི་བུའི་བདུད་འཇོམས་སོ། །
en: The māra of the gods is defeated by realizing that nirvāṇa is peace.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ནང་གི་ཉོན་མོངས་པའི་དྲི་མ་སྤངས་ཏེ་བྱང་ཆུབ་ཀྱི་སེམས་མ་བརྗེད་པར་སྦྱིན་པ་བྱིན་ནས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེའི་ཚེ་ཕུང་པོའི་བདུད་ཚར་གཅོད་པ་ཡིན་ནོ། །
en: “Moreover, Sāgaramati, when bodhisattvas discard the stains of their inner afflictions, practice giving without forgetting the mind of awakening, and dedicate this toward omniscience, they destroy the māra of the aggregates.

source: གང་གི་ཚེ་ལུས་ལ་མི་ལྟ་ཞིང་ལུས་ལ་མ་ཆགས་པར་སྦྱིན་པ་བྱིན་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེའི་ཚེ་ཉོན་མོངས་པའི་བདུད་ཚར་གཅོད་པ་ཡིན་ནོ། །
en: When bodhisattvas practice giving without consideration for, or attachment to, the body and dedicate this to omniscience, they destroy the māra of the afflictions.

source: གང་གི་ཚེ་ཀྱེ་མ་ལོངས་སྤྱོད་འདི་དག་ནི་མི་རྟག་པ་ཐུན་མོང་བ་སྟེ། དེ་དག་ལས་བདག་གིས་སྙིང་པོ་བླངས་པར་འགྱུར་རོ་སྙམ་སྟེ་སྦྱིན་པ་བྱིན་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེའི་ཚེ་འཆི་བདག་གི་བདུད་ཚར་གཅོད་པ་ཡིན་ནོ། །
en: When bodhisattvas practice giving with the thought, ‘Ah, I shall make good use of these possessions of mine that are otherwise impermanent and ordinary,’ and dedicate this to omniscience, they destroy the māra of the Lord of Death.

source: གང་གི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་ནས། སེམས་ཅན་ཐམས་ཅད་བསྡུ་བའི་ཕྱིར་རབ་ཏུ་ཐར་བར་བྱ་བའི་བློས་སྦྱིན་པ་བྱིན་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པ་དེའི་ཚེ། ལྷའི་བུའི་བདུད་ཚར་གཅོད་པ་ཡིན་ནོ། །
en: When bodhisattvas develop great compassion for all beings, practice giving in order to attract all beings and liberate them, and dedicate this to omniscience, they destroy the māra of the gods.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པར་འགྲོ་བའི་སྐྱེ་བ་ལ་མངོན་པར་འདོད་པ་མེད་པར་ཚུལ་ཁྲིམས་སྲུང་བས་ཕུང་པོའི་བདུད་ཚར་གཅོད་དོ། །
en: “Moreover, Sāgaramati, bodhisattvas destroy the māra of the aggregates by maintaining discipline without any desire to prolong their rebirths in saṃsāra.

source: བདག་མེད་པར་ལྟ་བ་ལ་གནས་ཏེ་ཚུལ་ཁྲིམས་སྲུང་བས་ཉོན་མོངས་པའི་བདུད་ཚར་གཅོད་དོ། །
en: Bodhisattvas destroy the māra of the afflictions by maintaining discipline within the view of selflessness.

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་སྟེ་རྒ་ཤི་ལས་བཟླ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་བས་འཆི་བདག་གི་བདུད་ཚར་གཅོད་དོ། །
en: Bodhisattvas destroy the māra of the Lord of Death by maintaining discipline in order to undermine aging and death with pure discipline.

source: བདག་གིས་ཚུལ་ཁྲིམས་འཆལ་པའི་སེམས་ཅན་རྣམས་འཕགས་པའི་ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་དགོད་པར་བྱའོ་སྙམ་སྟེ། ཚུལ་ཁྲིམས་སྲུང་བས་ལྷའི་བུའི་བདུད་ཚར་གཅོད་དོ། །
en: Bodhisattvas destroy the māra of the gods by maintaining discipline with the intention that they will establish all beings that have corrupt discipline in the discipline of noble beings.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བདག་མི་དམིགས་པར་བཟོད་པ་སྒོམ་པས་ཕུང་པོའི་བདུད་ཚར་གཅོད་དོ། །
en: “Moreover, Sāgaramati, bodhisattvas destroy the māra of the aggregates by cultivating patience without apprehending a self.

source: སེམས་ཅན་མི་དམིགས་པར་བཟོད་པ་སྒོམ་པས་ཉོན་མོངས་པའི་བདུད་ཚར་གཅོད་དོ། །
en: Bodhisattvas destroy the māra of the afflictions by cultivating patience without apprehending beings.

source: འཁོར་བ་མི་དམིགས་པར་བཟོད་པ་སྒོམ་པས་འཆི་བདག་གི་བདུད་ཚར་གཅོད་དོ། །
en: Bodhisattva destroy the māra of the Lord of Death by cultivating patience without apprehending saṃsāra.

source: མྱ་ངན་ལས་འདས་པ་མི་དམིགས་པར་བཟོད་པ་སྒོམ་པས་ལྷའི་བུའི་བདུད་ཚར་གཅོད་དོ། །
en: Bodhisattvas destroy the māra of the gods by cultivating patience without apprehending nirvāṇa.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལུས་དབེན་པར་བརྩོན་འགྲུས་རྩོམ་པས་ཕུང་པོའི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: “Moreover, Sāgaramati, bodhisattvas transcend the māra of the aggregates by practicing diligence while disengaging from the body.

source: སེམས་དབེན་པར་བརྩོན་འགྲུས་རྩོམ་པས་ཉོན་མོངས་པའི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: Bodhisattvas transcend the māra of the afflictions by practicing diligence while disengaging from the mind.

source: སྐྱེ་བ་མེད་པ་དང་འབྱུང་བ་མེད་པར་བརྩོན་འགྲུས་རྩོམ་པས་འཆི་བདག་གི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: Bodhisattvas transcend the māra of the Lord of Death by practicing diligence in the midst of the unborn and non-arising.

source: འཁོར་བས་ཡོངས་སུ་མི་སྐྱོ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པས་ལྷའི་བུའི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: Bodhisattvas transcend the māra of the gods by practicing diligence for the sake of ripening beings and upholding the Dharma without being saddened by saṃsāra.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་ལ་མི་གནས་པར་བསམ་གཏན་བྱེད་པས་ཕུང་པོའི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: “Moreover, Sāgaramati, bodhisattvas transcend the māra of the aggregates by practicing concentration without sustaining the aggregates.

source: ཁམས་ལ་མི་གནས་པར་བསམ་གཏན་བྱེད་པས་ཉོན་མོངས་པའི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: Bodhisattvas transcend the māra of the afflictions by practicing concentration without sustaining the elements.

source: སྐྱེ་མཆེད་ལ་མི་གནས་པར་བསམ་གཏན་བྱེད་པས་འཆི་བདག་གིས་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: Bodhisattvas transcend the māra of the Lord of Death by practicing concentration without sustaining the sense sources.

source: བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་པས་ལྷའི་བུའི་བདུད་ལས་ཤིན་ཏུ་འདའོ། །
en: Bodhisattvas transcend the māra of the gods by dedicating these aspects of practicing concentration to awakening.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱིས་ཕུང་པོ་ལ་མཁས་པར་གྱུར་པས་ཕུང་པོའི་བདུད་ལས་རྒྱལ་ལོ། །
en: “Moreover, Sāgaramati, bodhisattvas find victory over the māra of the aggregates by utilizing insight to become learned in the aggregates.

source: ཤེས་རབ་ཀྱིས་ཁམས་ལ་མཁས་པར་གྱུར་པས་ཉོན་མོངས་པའི་བདུད་ལས་རྒྱལ་ལོ། །
en: Bodhisattvas find victory over the māra of the afflictions by utilizing insight to become learned in the elements.

source: ཤེས་རབ་ཀྱིས་སྐྱེ་མཆེད་ལ་མཁས་པར་གྱུར་པས་འཆི་བདག་གི་བདུད་ལས་རྒྱལ་ལོ། །
en: Bodhisattvas find victory over the māra of the Lord of Death by utilizing insight to become learned in the sense sources.

source: ཤེས་རབ་ཀྱིས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པར་གྱུར་པས་ཡང་དག་པའི་མཐའ་ཡང་མངོན་སུམ་མི་བྱེད་པས་ལྷའི་བུའི་བདུད་ལས་རྒྱལ་ལོ། །
en: Bodhisattvas find victory over the māra of the gods by utilizing insight to become learned in dependent origination and thus not actualizing the limit of reality.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་སྟོང་པར་མོས་པས་ཕུང་པོའི་བདུད་ཀྱིས་སྐབས་མི་རྙེད་དོ། །
en: “Moreover, Sāgaramati, the māra of the aggregates has no chance when bodhisattvas aspire to the emptiness of all phenomena.

source: ཆོས་ཐམས་ཅད་ལ་མཚན་མ་མེད་པར་ཡིད་ཆེས་པས་ཉོན་མོངས་པའི་བདུད་ཀྱིས་སྐབས་མི་རྙེད་དོ། །
en: The māra of the afflictions has no chance when bodhisattvas trust that all phenomena are signless.

source: ཆོས་ཐམས་ཅད་སྨོན་པ་མེད་པར་སོམ་ཉི་མེད་པས་འཆི་བདག་གི་བདུད་ཀྱིས་སྐབས་མི་རྙེད་དོ། །
en: The māra of the Lord of Death has no chance when bodhisattvas have no doubt that all phenomena are the wishless state.

source: ཆོས་ཐམས་ཅད་ལ་མངོན་པར་འདུ་བྱ་བ་མེད་པར་ཐེ་ཚོམ་མེད་ལ་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱ་བས་ཀྱང་མི་ངོམས་པས་ལྷའི་བུའི་བདུད་ཀྱིས་སྐབས་མི་རྙེད་དོ། །
en: The māra of the gods has no chance when bodhisattvas have no doubt that phenomena are unconditioned, and do not become arrogant even if they gather roots of virtue.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་ཞིང་། ལུས་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་དེའི་ཚེ་ཕུང་པོའི་བདུད་ཡང་དག་པར་འཇོམས་སོ། །
en: “Moreover, Sāgaramati, when bodhisattvas cultivate the application of mindfulness of body to the body and do not form the concepts that go along with the body, they defeat the māra of the aggregates.

source: གང་གི་ཚེ་ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་ཞིང་། ཚོར་བ་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་དེའི་ཚེ་ཉོན་མོངས་པའི་བདུད་ཡང་དག་པར་འཇོམས་སོ། །
en: When bodhisattvas cultivate the application of mindfulness of feelings to feelings and do not form the concepts that go along with feelings, they defeat the māra of the afflictions.

source: གང་གི་ཚེ་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་ཞིང་། སེམས་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་ཀྱང་རྣམ་པར་མི་རྟོག་པ་དེའི་ཚེ་འཆི་བདག་གི་བདུད་ཡང་དག་པར་འཇོམས་སོ། །
en: When bodhisattvas cultivate the application of mindfulness of mind to the mind and do not form the concepts that go along with the mind, they defeat the māra of the Lord of Death.

source: གང་གི་ཚེ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་ཞིང་ཆོས་དང་། ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་ཀྱང་རྣམ་པར་མི་རྟོག་ལ་བྱང་ཆུབ་ཀྱི་བསམ་པ་ཡང་འཁྲུགས་པར་མི་བྱེད་པ་དེའི་ཚེ་ལྷའི་བུའི་བདུད་ཡང་དག་པར་འཇོམས་སོ། །
en: When bodhisattvas cultivate the application of mindfulness of mental phenomena to mental phenomena and do not form the concepts that go along with mental phenomena, protecting their intention to awaken, they defeat the māra of the gods.

source: བློ་གྲོས་རྒྱ་མཚོ་བདུད་ཀྱི་ལས་འདི་དག་ཐམས་ཅད་ནི་བདག་གིས་ཀུན་ནས་ལྡང་བས་ཀུན་ནས་ལངས་པ་དག་སྟེ།
en: “Sāgaramati, all of the māras’ activities are motivated by the workings of the self.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བདག་གིས་ཀུན་ནས་ལྡང་བ་ཀུན་ནས་ལངས་པར་མི་བྱེད་དོ། །
en: Thus, bodhisattvas do not motivate themselves by the workings of the self.

source: བདག་གང་ཡིན་པ་དེ་ནི་བདག་མ་ཡིན་ཞིང་བདག་མེད་པ་སྟེ་དེ་ལ་ཆོས་གང་གིས་ཀུན་ནས་ལྡང་བ་ཡང་མེད་དོ། །
en: The self is not a self, but is selfless, so there is no phenomenon than can generate the self.

source: དེ་དེ་ལྟར་སོ་སོར་རྟོག་པའི་ཡེ་ཤེས་ཀྱིས་རིག་ནས་གང་གི་ཚེ་སེམས་ཅན་མི་ཤེས་པ་རྣམས་ཀྱི་ཆེད་དུ་ཐེག་པ་ཆེན་པོའི་གོ་ཆ་གྱོན་པར་བྱེད་པ་དེའི་ཚེ་བདག་ཏུ་སྒྲོ་འདོགས་པ་དང་། གཞན་དུ་སྒྲོ་འདོགས་པའི་ཕྱིར་གོ་ཆ་མི་གྱོན་ནོ། །
en: Cognizing this with discriminating wisdom, bodhisattvas don the armor of the Great Vehicle for the sake of ignorant beings, not because they impute self or other.

source: གོ་ཆ་བགོས་ནས་ཀྱང་ཇི་ལྟར་ན་བདག་གི་གོ་ཆ་འདི་དོན་ཡོད་པར་འགྱུར་སྙམ་དུ་དཔྱོད་དེ།
en: When wearing this armor, they will ask themselves how to make this armor meaningful.

source: དེ་འདི་སྙམ་དུ་
en: They think the following:
